In [2]:
import numpy as np
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df=pd.DataFrame(
    {
        'Color': ['Red', 'Blue', 'Green', 'Blue', 'Red']
    }
)

In [4]:
df_encoded=pd.get_dummies(df,columns=['Color'],drop_first=True,sparse=False).astype('int')

In [5]:
df_encoded

   Color_Green  Color_Red
0            0          1
1            0          0
2            1          0
3            0          0
4            0          1

In [6]:
df=pd.concat([df,df_encoded],axis=1)

In [7]:
df.head()

   Color  Color_Green  Color_Red
0    Red            0          1
1   Blue            0          0
2  Green            1          0
3   Blue            0          0
4    Red            0          1

In [8]:
from sklearn.preprocessing import OneHotEncoder
ohe=OneHotEncoder(drop='first',sparse_output=False)
color_encoded=ohe.fit_transform(df[['Color']])

In [9]:
df_encoder=pd.DataFrame(color_encoded,columns=ohe.get_feature_names_out(['Color'])).astype('int')

In [10]:
df_encoded

   Color_Green  Color_Red
0            0          1
1            0          0
2            1          0
3            0          0
4            0          1

In [12]:
df=pd.concat([df,df_encoder])

In [13]:
df.head()

   Color  Color_Green  Color_Red
0    Red            0          1
1   Blue            0          0
2  Green            1          0
3   Blue            0          0
4    Red            0          1

In [14]:
df=pd.read_csv(r"F:\ML\100 days ml\ML practice\data\Titanic-Dataset.csv")

In [15]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline

In [17]:
x=df.drop(columns=['Survived'])
y=df['Survived']

In [19]:
x.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [22]:
df.dropna(inplace=True)

In [24]:
df.duplicated().sum()

0

In [26]:
x = df[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked']]
y = df['Survived']

In [28]:
from sklearn.preprocessing import StandardScaler

In [29]:
numeric_features = ['Age', 'Fare', 'SibSp', 'Parch']
categorical_features = ['Sex', 'Embarked', 'Pclass']

preprocessor=ColumnTransformer([
    ('num',StandardScaler(),numeric_features),
    ('cat',OneHotEncoder(handle_unknown='ignore'),categorical_features)
])

In [30]:
from sklearn.linear_model import LogisticRegression

In [31]:
pipe=Pipeline([
    ('prep',preprocessor),
    ('model',LogisticRegression())
])

In [32]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=42)

In [33]:
pipe.fit(x_train,y_train)
score=pipe.score(x_test,y_test)
print(score)

0.7567567567567568